test/tests/bcs/multiphase_external_temperature/template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          multiphaseEuler;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime 0.02;

deltaT 0.0001;

writeControl timeStep;

writeInterval 100;

purgeWrite      0;

writeFormat     ascii;

writePrecision 15;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep no;

maxCo           0.5;

maxDeltaT       0.001;

// ************************************************************************* //
